Question 1

In [1]:
import numpy as np
import pandas as pd

In [2]:
results=pd.read_csv('results.csv')

In [3]:
results

     model     r2         cp           rss
0   model1  0.849   3785.130  129345695398
1   model2  0.782  29492.891  186953511457
2   model3  0.853   2216.066  125825141230
3   model4  0.853   2515.617  126496397331
4   model5  0.856   1122.912  123371039554
5   model6  0.855   1729.176  124729600876
6   model7  0.859     11.453  120875920936
7   model8  0.856   1108.412  123334065616
8   model9  0.859      5.883  120858956753
9  model10  0.859     11.752  120872109331

In [4]:
results.pivot_longer(cols = 2:4, names_to = 'metric', values_to = 'value')

SyntaxError: invalid syntax (4182696047.py, line 1)

In [5]:
results.melt(id_vars='model', var_name='metric', value_name='value')

      model metric         value
0    model1     r2  8.490000e-01
1    model2     r2  7.820000e-01
2    model3     r2  8.530000e-01
3    model4     r2  8.530000e-01
4    model5     r2  8.560000e-01
5    model6     r2  8.550000e-01
6    model7     r2  8.590000e-01
7    model8     r2  8.560000e-01
8    model9     r2  8.590000e-01
9   model10     r2  8.590000e-01
10   model1     cp  3.785130e+03
11   model2     cp  2.949289e+04
12   model3     cp  2.216066e+03
13   model4     cp  2.515617e+03
14   model5     cp  1.122912e+03
15   model6     cp  1.729176e+03
16   model7     cp  1.145300e+01
17   model8     cp  1.108412e+03
18   model9     cp  5.883000e+00
19  model10     cp  1.175200e+01
20   model1    rss  1.293457e+11
21   model2    rss  1.869535e+11
22   model3    rss  1.258251e+11
23   model4    rss  1.264964e+11
24   model5    rss  1.233710e+11
25   model6    rss  1.247296e+11
26   model7    rss  1.208759e+11
27   model8    rss  1.233341e+11
28   model9    rss  1.208590e+11
29  model10    rss  1.208721e+11

Question 2

In [23]:
data = pd.DataFrame({
"City": ["New York", "Los Angeles", "Chicago"],
"ProductA_Q1": [120, 130, 140],
"ProductA_Q2": [110, 120, 130],
"ProductA_Q3": [100, 150, 110],
"ProductA_Q4": [120, 110, 160],
"ProductB_Q1": [200, 210, 220],
"ProductB_Q2": [190, 200, 210],
"ProductB_Q3": [220, 180, 230],
"ProductB_Q4": [210, 160, 200],
})

In [7]:
data

,City,ProductA_Q1,ProductA_Q2,ProductA_Q3,ProductA_Q4,ProductB_Q1,ProductB_Q2,ProductB_Q3,ProductB_Q4
0,New York,120,110,100,120,200,190,220,210
1,Los Angeles,130,120,150,110,210,200,180,160
2,Chicago,140,130,110,160,220,210,230,200

In [10]:
data1=data.melt(id_vars='City',var_name='Product',value_name='Sales')

In [24]:
data1.groupby(by='Product',as_index=False).agg({'Sales':'sum'})  1020 960 990

       Product  Sales
0  ProductA_Q1    390
1  ProductA_Q2    360
2  ProductA_Q3    360
3  ProductA_Q4    390
4  ProductB_Q1    630
5  ProductB_Q2    600
6  ProductB_Q3    630
7  ProductB_Q4    570

QQuestion 3

In [25]:
data_sales = pd.DataFrame({
    "company": ["Apple", "Alphabet", "Amazon", "Microsoft"],
    "year_2017": [229234, 110855, 177866, 96571],
    "year_2018": [265595, 136819, 232887, 110360],
    "year_2019": [260174, 161857, 280522, 125843],
    "year_2020": [274515, 182527, 386064, 143015],
    "year_2021": [365817, 257637, 469822, 168088],
    "year_2022": [394328, 282386, 513983, 198270],
    "year_2023": [383285, 307394, 574785, 211915],
})
data_income = pd.DataFrame({
    "company": ["Apple", "Alphabet", "Amazon", "Microsoft"],
    "year_2017": [61344, 26178, 4106, 28970],
    "year_2018": [70898, 27524, 12421, 35011],
    "year_2019": [63930, 34231, 14541, 42933],
    "year_2020": [66288, 41224, 22899, 52959],
    "year_2021": [108949, 78714, 24879, 69916],
    "year_2022": [119437, 74842, 12248, 83383],
    "year_2023": [114301, 84293, 36852, 88523],
})

In [26]:
data_sales

,company,year_2017,year_2018,year_2019,year_2020,year_2021,year_2022,year_2023
0,Apple,229234,265595,260174,274515,365817,394328,383285
1,Alphabet,110855,136819,161857,182527,257637,282386,307394
2,Amazon,177866,232887,280522,386064,469822,513983,574785
3,Microsoft,96571,110360,125843,143015,168088,198270,211915

In [27]:
data_income

,company,year_2017,year_2018,year_2019,year_2020,year_2021,year_2022,year_2023
0,Apple,61344,70898,63930,66288,108949,119437,114301
1,Alphabet,26178,27524,34231,41224,78714,74842,84293
2,Amazon,4106,12421,14541,22899,24879,12248,36852
3,Microsoft,28970,35011,42933,52959,69916,83383,88523

In [33]:
data_income.loc[3,'year_2017']/data_sales.loc[3,'year_2017']

0.2999865384017976

In [13]:
sales_tidy = data_sales.melt(id_vars="company", var_name="year", value_name="sales")
income_tidy = data_income.melt(id_vars="company", var_name="year", value_name="income")

In [14]:
sales_tidy["year"] = sales_tidy["year"].str.replace("year_", "").astype(int)
income_tidy["year"] = income_tidy["year"].str.replace("year_", "").astype(int)

In [15]:
data_combined = pd.merge(sales_tidy, income_tidy, on=["company", "year"])

In [16]:
data_combined["operating_margin"] = data_combined["income"] / data_combined["sales"]

In [17]:
ms_2017 = data_combined.query("company == 'Microsoft' and year == 2017")
ratio_2017 = ms_2017["operating_margin"].values[0]
ratio_2017

0.2999865384017976

Question 4

In [34]:
data_income.loc[3,'year_2023']/data_sales.loc[3,'year_2023']

0.417728806361041

In [18]:
ms_2023_ratio = data_combined.query("company == 'Microsoft' and year == 2023")["income"].values[0] / \
                data_combined.query("company == 'Microsoft' and year == 2023")["sales"].values[0]
print(ms_2023_ratio)

0.417728806361041

Question 5

In [19]:
alphabet_2017_ratio = data_combined.query("company == 'Alphabet' and year == 2017")["income"].values[0] / \
                      data_combined.query("company == 'Alphabet' and year == 2017")["sales"].values[0]
print(alphabet_2017_ratio)

0.23614631726128726

Question 6

In [20]:
alphabet_2023_ratio = data_combined.query("company == 'Alphabet' and year == 2023")["income"].values[0] / \
                      data_combined.query("company == 'Alphabet' and year == 2023")["sales"].values[0]
print(alphabet_2023_ratio)

0.27421810445226646

Question 7

In [21]:
avg_2017_ratio = data_combined.query("year == 2017")["income"].sum() / \
                 data_combined.query("year == 2017")["sales"].sum()
print(avg_2017_ratio)

0.1962455616198501

Question 8

In [22]:
avg_2023_ratio = data_combined.query("year == 2023")["income"].sum() / \
                 data_combined.query("year == 2023")["sales"].sum()
print(avg_2023_ratio)

0.2192863171873974

In [35]:
import pandas as pd

# 1. Create the initial DataFrames
data_sales = pd.DataFrame({
    "company": ["Apple", "Alphabet", "Amazon", "Microsoft"],
    "year_2017": [229234, 110855, 177866, 96571],
    "year_2018": [265595, 136819, 232887, 110360],
    "year_2019": [260174, 161857, 280522, 125843],
    "year_2020": [274515, 182527, 386064, 143015],
    "year_2021": [365817, 257637, 469822, 168088],
    "year_2022": [394328, 282386, 513983, 198270],
    "year_2023": [383285, 307394, 574785, 211915],
})

data_income = pd.DataFrame({
    "company": ["Apple", "Alphabet", "Amazon", "Microsoft"],
    "year_2017": [61344, 26178, 4106, 28970],
    "year_2018": [70898, 27524, 12421, 35011],
    "year_2019": [63930, 34231, 14541, 42933],
    "year_2020": [66288, 41224, 22899, 52959],
    "year_2021": [108949, 78714, 24879, 69916],
    "year_2022": [119437, 74842, 12248, 83383],
    "year_2023": [114301, 84293, 36852, 88523],
})

# 2. Tidy the data
# Melt the DataFrames to convert years from columns to rows
sales_melted = data_sales.melt(id_vars="company", var_name="year", value_name="sales")
income_melted = data_income.melt(id_vars="company", var_name="year", value_name="income")

# Clean the 'year' column to be an integer
sales_melted['year'] = sales_melted['year'].str.replace('year_', '').astype(int)
income_melted['year'] = income_melted['year'].str.replace('year_', '').astype(int)

# 3. Merge the two datasets into a single DataFrame
df = pd.merge(sales_melted, income_melted, on=["company", "year"])

# 4. Calculate the operating margin ratio
df['operating_margin'] = df['income'] / df['sales']

# 5. Compute the specific values requested
# (a) Microsoft in 2017
msft_2017_margin = df.loc[(df['company'] == 'Microsoft') & (df['year'] == 2017), 'operating_margin'].iloc[0]

# (b) Microsoft in 2023
msft_2023_margin = df.loc[(df['company'] == 'Microsoft') & (df['year'] == 2023), 'operating_margin'].iloc[0]

# (c) Alphabet in 2017
alphabet_2017_margin = df.loc[(df['company'] == 'Alphabet') & (df['year'] == 2017), 'operating_margin'].iloc[0]

# (d) Alphabet in 2023
alphabet_2023_margin = df.loc[(df['company'] == 'Alphabet') & (df['year'] == 2023), 'operating_margin'].iloc[0]

# (e) Average across the four companies in 2017
avg_2017_margin = df[df['year'] == 2017]['operating_margin'].mean()

# (f) Average across the four companies in 2023
avg_2023_margin = df[df['year'] == 2023]['operating_margin'].mean()

# 6. Print the final results
print("--- Operating Margin Ratios ---")
print(f"(a) Microsoft in 2017: {msft_2017_margin:.4f}")
print(f"(b) Microsoft in 2023: {msft_2023_margin:.4f}")
print(f"(c) Alphabet in 2017: {alphabet_2017_margin:.4f}")
print(f"(d) Alphabet in 2023: {alphabet_2023_margin:.4f}")
print(f"(e) Average in 2017: {avg_2017_margin:.4f}")
print(f"(f) Average in 2023: {avg_2023_margin:.4f}")

--- Operating Margin Ratios ---
(a) Microsoft in 2017: 0.3000
(b) Microsoft in 2023: 0.4177
(c) Alphabet in 2017: 0.2361
(d) Alphabet in 2023: 0.2742
(e) Average in 2017: 0.2067
(f) Average in 2023: 0.2636

In [36]:
import pandas as pd

# 1. Create the initial DataFrames
data_sales = pd.DataFrame({
    "company": ["Apple", "Alphabet", "Amazon", "Microsoft"],
    "year_2017": [229234, 110855, 177866, 96571],
    "year_2018": [265595, 136819, 232887, 110360],
    "year_2019": [260174, 161857, 280522, 125843],
    "year_2020": [274515, 182527, 386064, 143015],
    "year_2021": [365817, 257637, 469822, 168088],
    "year_2022": [394328, 282386, 513983, 198270],
    "year_2023": [383285, 307394, 574785, 211915],
})

data_income = pd.DataFrame({
    "company": ["Apple", "Alphabet", "Amazon", "Microsoft"],
    "year_2017": [61344, 26178, 4106, 28970],
    "year_2018": [70898, 27524, 12421, 35011],
    "year_2019": [63930, 34231, 14541, 42933],
    "year_2020": [66288, 41224, 22899, 52959],
    "year_2021": [108949, 78714, 24879, 69916],
    "year_2022": [119437, 74842, 12248, 83383],
    "year_2023": [114301, 84293, 36852, 88523],
})

# 2. Tidy the data
# Melt the DataFrames to convert years from columns to rows
sales_melted = data_sales.melt(id_vars="company", var_name="year", value_name="sales")
income_melted = data_income.melt(id_vars="company", var_name="year", value_name="income")

# Clean the 'year' column to be an integer
sales_melted['year'] = sales_melted['year'].str.replace('year_', '').astype(int)
income_melted['year'] = income_melted['year'].str.replace('year_', '').astype(int)

# 3. Merge the two datasets into a single DataFrame
df = pd.merge(sales_melted, income_melted, on=["company", "year"])

# 4. Calculate the operating margin ratio
df['operating_margin'] = df['income'] / df['sales']

# 5. Compute the specific values requested
# (a) Microsoft in 2017
msft_2017_margin = df.loc[(df['company'] == 'Microsoft') & (df['year'] == 2017), 'operating_margin'].iloc[0]

# (b) Microsoft in 2023
msft_2023_margin = df.loc[(df['company'] == 'Microsoft') & (df['year'] == 2023), 'operating_margin'].iloc[0]

# (c) Alphabet in 2017
alphabet_2017_margin = df.loc[(df['company'] == 'Alphabet') & (df['year'] == 2017), 'operating_margin'].iloc[0]

# (d) Alphabet in 2023
alphabet_2023_margin = df.loc[(df['company'] == 'Alphabet') & (df['year'] == 2023), 'operating_margin'].iloc[0]

# (e) Average across the four companies in 2017
avg_2017_margin = df[df['year'] == 2017]['operating_margin'].mean()

# (f) Average across the four companies in 2023
avg_2023_margin = df[df['year'] == 2023]['operating_margin'].mean()

# 6. Print the final results without rounding
print("--- Operating Margin Ratios (Unrounded) ---")
print(f"(a) Microsoft in 2017: {msft_2017_margin}")
print(f"(b) Microsoft in 2023: {msft_2023_margin}")
print(f"(c) Alphabet in 2017: {alphabet_2017_margin}")
print(f"(d) Alphabet in 2023: {alphabet_2023_margin}")
print(f"(e) Average in 2017: {avg_2017_margin}")
print(f"(f) Average in 2023: {avg_2023_margin}")

--- Operating Margin Ratios (Unrounded) ---
(a) Microsoft in 2017: 0.2999865384017976
(b) Microsoft in 2023: 0.417728806361041
(c) Alphabet in 2017: 0.23614631726128726
(d) Alphabet in 2023: 0.27421810445226646
(e) Average in 2017: 0.20670548298031927
(f) Average in 2023: 0.263568860364897